3A/MATH213/Systems-Input-Responses.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-29 Thu 17:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Systems Input and Responses</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Systems Input and Responses</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf3e1647">1. Impulse Response of an LTI</a>
<ul>
<li><a href="#orgabb0821">1.1. Kronecker Delta</a></li>
</ul>
</li>
<li><a href="#orgbac4991">2. Response of an LTI to Exponential Inputs</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf3e1647" class="outline-2">
<h2 id="orgf3e1647"><span class="section-number-2">1.</span> Impulse Response of an LTI</h2>
<div class="outline-text-2" id="text-1">
<p>
For a linear DE with constant coefficients, the ZSR is \(Y(s) = H(s) F(s)\),
where \(H(s)\) is the transfer function of the DE and \(F(s)\) is the Laplace transform of the
forcing term.
</p>

<p>
The impulse response of the DE is
\[
        h(t) = \mathscr{L}^{-1} \{ H(t) \}
\]
which comes from setting \(f(t) = \delta (t)\) so the forcing term is an impulse.
This is the ZSR to a unit impulse.
</p>

<p>
By convolution theorem, this gives the zero-state solution \(y(t) = (h * f)(t)\).
</p>

<p>
This all holds for linear DEs with constant coefficients.
</p>

<p>
The response of an LTI system is the convolution of the input with the system&rsquo;s impulse
response.
In other words, given the LTI with input \(f(t)\) and output \(y(t)\),
$y(t) = (h * f)(t), where \(h(t)\) is the impulse response of the system.
</p>
</div>
<div id="outline-container-orgabb0821" class="outline-3">
<h3 id="orgabb0821"><span class="section-number-3">1.1.</span> Kronecker Delta</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The Kronecker delta function \(\delta [t]\) is defined as the function from \(\mathbb{Z}\) to
\(\{0, 1\}\) given by
\[
\delta [t] = \begin{cases}
1 & t = 0 \\
0 & \text{else}
\end{cases}
\]
</p>

<p>
For all functions \(f : \mathbb{Z} \to \mathbb{C}\),
\[
        f[t] = \sum_{\tau = -\infty}^{\infty} f [\tau] \delta[t - \tau]
\]
This shows how to decompose every function \(f\) into a linear combination of impulse functions.
</p>
</div>
</div>
</div>
<div id="outline-container-orgbac4991" class="outline-2">
<h2 id="orgbac4991"><span class="section-number-2">2.</span> Response of an LTI to Exponential Inputs</h2>
<div class="outline-text-2" id="text-2">
<p>
If \(S: f \to y\) is an LTI, then for any \(s \in \mathbb{C}\)
\[
        e^{st} \to H(s) e^{st}
\]
where \(H(s)\) is the LT of the system&rsquo;s impulse response and is called the system&rsquo;s transfer
function.
</p>

<p>
This means that complex exponentials are eigenfunctions of LTIs and the transfer function tells
you the eigenvalues of the system.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-02-29 Thu 17:18</p>
</div>
</body>
</html>
