3A/MATH213/Systems-Input-Responses.tex
% Created 2024-04-05 Fri 12:00
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip, darkmode, mathrsfs}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{Systems Input and Responses}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Systems Input and Responses},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Impulse Response of an LTI}
\label{sec:org64a4ca0}
For a linear DE with constant coefficients, the ZSR is \(Y(s) = H(s) F(s)\),
where \(H(s)\) is the transfer function of the DE and \(F(s)\) is the Laplace transform of the
forcing term.

The impulse response of the DE is
$$
h(t) = \mathscr{L}^{-1} \{ H(t) \}
$$
which comes from setting \(f(t) = \delta (t)\) so the forcing term is an impulse.
This is the ZSR to a unit impulse.

By convolution theorem, this gives the zero-state solution \(y(t) = (h * f)(t)\).

This all holds for linear DEs with constant coefficients.

The response of an LTI system is the convolution of the input with the system's impulse
response.
In other words, given the LTI with input \(f(t)\) and output \(y(t)\),
\(y(t) = (h * f)(t)\), where \(h(t)\) is the impulse response of the system.
\subsection{Kronecker Delta}
\label{sec:orgde536c0}
The Kronecker delta function \(\delta [t]\) is defined as the function from \(\mathbb{Z}\) to
\(\{0, 1\}\) given by
$$
\delta [t] = \begin{cases}
1 & t = 0 \\
0 & \text{else}
\end{cases}
$$

For all functions \(f : \mathbb{Z} \to \mathbb{C}\),
$$
f[t] = \sum_{\tau = -\infty}^{\infty} f [\tau] \delta[t - \tau]
$$
This shows how to decompose every function \(f\) into a linear combination of impulse functions.
\section{Response of an LTI to Exponential Inputs}
\label{sec:orgf8cfd85}
If \(S: f \to y\) is an LTI, then for any \(s \in \mathbb{C}\)
$$
e^{st} \to H(s) e^{st}
$$
where \(H(s)\) is the LT of the system's impulse response and is called the system's transfer
function.

This means that complex exponentials are eigenfunctions of LTIs and the transfer function tells
you the eigenvalues of the system.
\end{document}
